---
type: AdvancedOpaque
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 15
tags: [revit-api, class]
---

# AdvancedOpaque

`Autodesk.Revit.DB.Visual.AdvancedOpaque` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | OpaqueAlbedo | 2018.1 | `public static string OpaqueAlbedo { get ; }` |
| Property | OpaqueEmission | 2018.1 | `public static string OpaqueEmission { get ; }` |
| Property | OpaqueF0 | 2018.1 | `public static string OpaqueF0 { get ; }` |
| Property | OpaqueLuminance | 2018.1 | `public static string OpaqueLuminance { get ; }` |
| Property | OpaqueLuminanceModifier | 2018.1 | `public static string OpaqueLuminanceModifier { get ; }` |
| Property | OpaqueMfp | 2018.1 | `public static string OpaqueMfp { get ; }` |
| Property | OpaqueMfpModifier | 2018.1 | `public static string OpaqueMfpModifier { get ; }` |
| Property | OpaqueTranslucency | 2018.1 | `public static string OpaqueTranslucency { get ; }` |
| Property | SurfaceAlbedo | 2018.1 | `public static string SurfaceAlbedo { get ; }` |
| Property | SurfaceAnisotropy | 2018.1 | `public static string SurfaceAnisotropy { get ; }` |
| Property | SurfaceCutout | 2018.1 | `public static string SurfaceCutout { get ; }` |
| Property | SurfaceNdfType | 2018.1 | `public static string SurfaceNdfType { get ; }` |
| Property | SurfaceNormal | 2018.1 | `public static string SurfaceNormal { get ; }` |
| Property | SurfaceRotation | 2018.1 | `public static string SurfaceRotation { get ; }` |
| Property | SurfaceRoughness | 2018.1 | `public static string SurfaceRoughness { get ; }` |